tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d/system/blockMeshDict
/* Case B 2-D: paper axial layout; tower width = area-equivalent W=Dt^2/D.
   Physical circular venting ratio is (Dt/D)^2; planar width W/D must match
   that ratio, otherwise the bore vents too freely and Yfs* stalls < 1. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale   1;

// Dt=0.0127, D=0.094 → W=Dt^2/D=0.0017159574; centre x=3.516
// half-width = 0.0008579787 → x in [3.5151420213, 3.5168579787]
vertices
(
    (0           -0.047 -0.002) (0            0.047 -0.002) (0           -0.047  0.002) (0            0.047  0.002)
    (0.546       -0.047 -0.002) (0.546        0.047 -0.002) (0.546       -0.047  0.002) (0.546        0.047  0.002)
    (3.5151420213 -0.047 -0.002) (3.5151420213  0.047 -0.002) (3.5151420213 -0.047  0.002) (3.5151420213  0.047  0.002)
    (3.5168579787 -0.047 -0.002) (3.5168579787  0.047 -0.002) (3.5168579787 -0.047  0.002) (3.5168579787  0.047  0.002)
    (4.006       -0.047 -0.002) (4.006        0.047 -0.002) (4.006       -0.047  0.002) (4.006        0.047  0.002)
    (3.5151420213  0.957 -0.002) (3.5151420213  0.957  0.002) (3.5168579787  0.957 -0.002) (3.5168579787  0.957  0.002)
);
blocks
(
    hex (0 4 5 1 2 6 7 3)           (160 28 1) simpleGrading (1 1 1)
    hex (4 8 9 5 6 10 11 7)         (860 28 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11)     (10  28 1) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15)   (140 28 1) simpleGrading (1 1 1)
    hex (9 13 22 20 11 15 23 21)    (10 400 1) simpleGrading (1 1 1)
);
edges ();
boundary
(
    walls { type wall; faces (
        (0 2 3 1) (17 19 18 16) (4 6 2 0) (8 10 6 4) (12 14 10 8) (16 18 14 12)
        (1 3 7 5) (5 7 11 9) (13 15 19 17) (9 11 21 20) (22 23 15 13)
    ); }
    atmosphere { type patch; faces ( (20 21 23 22) ); }
    frontAndBack { type empty; faces (
        (0 1 5 4) (2 6 7 3) (4 5 9 8) (6 10 11 7) (8 9 13 12)
        (10 14 15 11) (12 13 17 16) (14 18 19 15) (9 13 22 20) (11 15 23 21)
    ); }
);
